-- phpMyAdmin SQL Dump
-- version 5.2.1
-- https://www.phpmyadmin.net/
--
-- Host: 127.0.0.1
-- Generation Time: Jun 11, 2025 at 07:10 AM
-- Server version: 10.4.32-MariaDB
-- PHP Version: 8.2.12

SET SQL_MODE = "NO_AUTO_VALUE_ON_ZERO";
START TRANSACTION;
SET time_zone = "+00:00";


/*!40101 SET @OLD_CHARACTER_SET_CLIENT=@@CHARACTER_SET_CLIENT */;
/*!40101 SET @OLD_CHARACTER_SET_RESULTS=@@CHARACTER_SET_RESULTS */;
/*!40101 SET @OLD_COLLATION_CONNECTION=@@COLLATION_CONNECTION */;
/*!40101 SET NAMES utf8mb4 */;

--
-- Database: `myblog`
--

-- --------------------------------------------------------

--
-- Table structure for table `categories`
--

CREATE TABLE `categories` (
  `id` int(11) NOT NULL,
  `name` varchar(255) NOT NULL
) ENGINE=InnoDB DEFAULT CHARSET=utf8mb4 COLLATE=utf8mb4_general_ci;

--
-- Dumping data for table `categories`
--

INSERT INTO `categories` (`id`, `name`) VALUES
(1, 'اخترفیزیک و ستاره‌شناسی'),
(2, 'سیارات و منظومه شمسی'),
(3, ' پدیده‌های فضایی'),
(4, ' کاوش‌های فضایی'),
(5, ' اخبار نجومی و کشفیات روز'),
(6, 'زندگی فرازمینی و زیست‌اخترشناسی');

-- --------------------------------------------------------

--
-- Table structure for table `posts`
--

CREATE TABLE `posts` (
  `id` int(11) NOT NULL,
  `title` varchar(100) NOT NULL,
  `image` varchar(255) DEFAULT NULL,
  `content` text NOT NULL,
  `created_at` datetime NOT NULL,
  `body` text NOT NULL,
  `is_featured` tinyint(1) DEFAULT 0,
  `category_id` int(11) DEFAULT NULL
) ENGINE=InnoDB DEFAULT CHARSET=utf8mb4 COLLATE=utf8mb4_general_ci;

--
-- Dumping data for table `posts`
--

INSERT INTO `posts` (`id`, `title`, `image`, `content`, `created_at`, `body`, `is_featured`, `category_id`) VALUES
(36, 'سفر به دل ستارگان؛ تولد تا مرگ ستاره‌ها', 'uploads/1748801834-mJ4y3WsYY2GdknbmZSFsJW.jpg', '', '0000-00-00 00:00:00', 'از شب‌های پرستاره‌ای که کودکی‌مان را جادو می‌کرد تا تصاویر خیره‌کننده تلسکوپ‌های فضایی، ستارگان همیشه در مرکز توجه انسان‌ها بوده‌اند. اما پشت این نور زیبا، داستانی نهفته که از تولدی آرام تا مرگی پرهیاهو ادامه دارد.\r\n\r\n تولد ستاره از دل تاریکی\r\nهمه‌چیز با ابرهای سرد و تاریکی به نام ابرهای مولکولی آغاز می‌شود؛ توده‌هایی از گاز هیدروژن، هلیوم و غبارهای کیهانی. این ابرها با کوچک‌ترین تحریک، مثل برخورد امواج شوک ناشی از انفجار یک ستاره دیگر، فشرده می‌شوند و درونشان مناطق چگالی‌بالا شکل می‌گیرد. این مناطق به مرور به هسته‌های پیش‌ستاره‌ای تبدیل می‌شوند.\r\n\r\nبا افزایش فشار، دما هم بالا می‌رود. وقتی دمای مرکز به حدود ۱۰ میلیون درجه برسد، واکنش‌های هسته‌ای آغاز شده و یک ستاره‌ی جوان (Protostar) متولد می‌شود.\r\n\r\nدوران اصلی زندگی: آرام اما فعال\r\nدر این مرحله، ستاره به تعادل رسیده و با تبدیل هیدروژن به هلیوم در مرکز خود انرژی تولید می‌کند. این انرژی باعث می‌شود که ستاره در برابر فروپاشی گرانشی مقاومت کند. این فاز را رشته اصلی (Main Sequence) می‌نامند که خورشید ما هم اکنون در این مرحله است.\r\n\r\nمدت زمان حضور یک ستاره در رشته اصلی بستگی به جرم آن دارد:\r\n\r\nستاره‌های کوچک: میلیاردها سال.\r\n\r\nستاره‌های بزرگ: فقط چند میلیون سال.\r\n\r\nپایان سوخت؛ آغاز فروپاشی\r\nوقتی سوخت هیدروژن تمام می‌شود، ستاره شروع به سوزاندن عناصر سنگین‌تر مثل هلیوم می‌کند. این مرحله باعث انبساط خارجی و انقباض داخلی می‌شود و ستاره به یک غول سرخ (در ستارگان سبک‌تر) یا ابرغول (در ستارگان سنگین‌تر) تبدیل می‌شود.\r\n\r\nمرگ پرهیاهو یا آرام؟\r\nمرگ ستاره هم بستگی به جرم آن دارد:\r\n\r\n▪ ستارگان کم‌جرم (مثل خورشید):\r\nدر پایان، پوسته بیرونی خود را به شکل سحابی سیاره‌نما رها می‌کنند و هسته‌ی باقی‌مانده تبدیل به کوتوله سفید می‌شود.\r\n\r\n▪ ستارگان پرجرم:\r\nبعد از انفجار عظیم به نام ابرنواختر (Supernova)، هسته یا تبدیل به ستاره نوترونی می‌شود یا اگر جرم خیلی زیاد باشد، به سیاه‌چاله فرو می‌ریزد.\r\n\r\nنتیجه‌گیری\r\nستاره‌ها فقط منبع نور نیستند؛ آن‌ها کارخانه‌هایی هستند که عناصر سنگین را می‌سازند و بعد از مرگ، مواد خود را در فضا پخش می‌کنند. بدون مرگ ستاره‌ها، ما وجود نداشتیم — چون عناصر بدن ما از دل آن‌ها آمده است.', 1, 3),
(37, 'سیاه‌چاله‌ها؛ دروازه‌هایی به ناشناخته‌های جهان', 'uploads/1748802008-black_hole.jpg', '', '0000-00-00 00:00:00', 'در دل کهکشان‌ها، اجرامی وجود دارند که آن‌قدر چگال و پرجرم‌اند که حتی نور هم نمی‌تواند از دام گرانش‌شان فرار کند. این اجرام اسرارآمیز که به آن‌ها سیاه‌چاله می‌گوییم، یکی از مرموزترین پدیده‌های شناخته‌شده در کیهان هستند؛ آن‌قدر عجیب که حتی قوانین فیزیک هم در نزدیکی‌شان دچار پیچیدگی می‌شود.\r\n\r\nسیاه‌چاله ناحیه‌ای از فضا است که در آن جرم بسیار زیاد، در حجم بسیار کمی فشرده شده و چنان میدان گرانشی عظیمی ایجاد کرده که هیچ چیز حتی نور هم نمی‌تواند از آن فرار کند. به همین دلیل به آن \"سیاه\" چاله می‌گویند؛ چون هیچ نوری از آن به بیرون نمی‌تابد تا ما بتوانیم آن را مستقیماً ببینیم.\r\n\r\nمرز اطراف یک سیاه‌چاله را افق رویداد می‌نامند. اگر چیزی از این مرز عبور کند، دیگر بازگشتی وجود ندارد. حتی اگر فضاپیمایی پیشرفته بتواند تا نزدیکی افق رویداد برود، نمی‌تواند اطلاعاتی از داخل آن برای ما بفرستد.\r\n\r\nبیشتر سیاه‌چاله‌ها حاصل مرگ ستاره‌های پرجرم هستند. وقتی چنین ستاره‌ای سوخت هسته‌ای‌اش را تمام می‌کند، دیگر نیرویی برای مقابله با گرانش درونی خود ندارد. در نتیجه، در یک لحظه به شدت فشرده می‌شود و در خودش فرو می‌ریزد. اگر جرم نهایی‌اش از یک حد خاص بیشتر باشد، هیچ چیز نمی‌تواند جلوی فروپاشی را بگیرد و در نهایت سیاه‌چاله شکل می‌گیرد.\r\n\r\nآیا سیاه‌چاله‌ها قابل مشاهده‌اند؟\r\nچون نور از سیاه‌چاله نمی‌گریزد، نمی‌توان آن را مستقیماً دید. اما دانشمندان با مشاهده تأثیر آن بر محیط اطراف، مانند:\r\n\r\nخمیدگی نور ستارگان پشت سر آن\r\nتابش پرتوهای X ناشی از گازهایی که در اطراف آن در حال سقوط‌اند\r\nمی‌توانند حضورش را تشخیص دهند.\r\nدر سال ۲۰۱۹، برای نخستین‌بار تصویری واقعی از سایه‌ی سیاه‌چاله‌ای در مرکز کهکشان M87 توسط تلسکوپ افق رویداد (EHT) ثبت شد. این عکس یک لحظه تاریخی در علم محسوب می‌شود.\r\n\r\nجمع‌بندی\r\nسیاه‌چاله‌ها به ما نشان می‌دهند که جهان چقدر می‌تواند پیچیده و شگفت‌انگیز باشد. آن‌ها حاصل پایان زندگی یک ستاره هستند، اما آغاز سوال‌های بی‌پایان برای فیزیکدانان و ستاره‌شناسان. هرچه بیشتر درباره‌شان می‌دانیم، بیشتر به نادانسته‌هایمان پی می‌بریم.', 1, 4),
(38, 'آیا در کیهان تنها هستیم؟ جستجوی حیات فرازمینی', 'uploads/1748802253-AlienGetty-27be7a5-e1683039906476.jpg', '', '0000-00-00 00:00:00', 'از دوران باستان تا امروز، آسمان شب همیشه الهام‌بخش سؤال‌هایی بوده که ذهن بشر را به خودش مشغول کرده‌اند. اما یکی از مهم‌ترین و هیجان‌انگیزترین این سؤال‌ها اینه: آیا ما در این جهان بی‌کران تنها هستیم؟ آیا ممکنه موجودات زنده‌ای در سیارات دیگر وجود داشته باشن؟ یا حتی موجوداتی پیشرفته‌تر از ما؟\r\n\r\nدر این مقاله نگاهی می‌کنیم به شواهد، نظریه‌ها و تحقیقات علمی در زمینه‌ی حیات فرازمینی.\r\n\r\nچرا فکر می‌کنیم تنها نیستیم؟\r\nکهکشان راه شیری ما حدود ۱۰۰ میلیارد ستاره داره، و تخمین زده می‌شه میلیاردها سیاره هم در این بین وجود داشته باشه. تازه این فقط یک کهکشانه؛ در کل جهان قابل مشاهده، بیش از ۲ تریلیون کهکشان وجود داره!\r\nبا این حجم عظیم از سیارات، احتمال وجود سیاراتی که شرایط حیات مثل زمین رو داشته باشن، اصلاً بعید نیست. همین مسئله پایه‌ی بسیاری از پروژه‌های جستجوی حیات فرازمینی شده.\r\n پروژه‌هایی برای یافتن حیات\r\n۱. پروژه‌ی SETI\r\n(جستجو برای هوش فرازمینی - Search for Extraterrestrial Intelligence)\r\nدر این پروژه، دانشمندان امواج رادیویی کیهانی رو اسکن می‌کنن تا ببینن آیا سیگنال‌هایی از تمدن‌های دیگر به زمین می‌رسه یا نه. تا حالا سیگنال خاصی تأیید نشده، ولی بعضی از امواج عجیب (مثل سیگنال معروف Wow!) باعث کنجکاوی زیادی شده.\r\n۲. کاوشگرهای سیاره‌ای\r\nناسا و آژانس فضایی اروپا کاوشگرهایی مثل کپلر و TESS رو برای کشف سیارات فراخورشیدی فرستادن. این ابزارها تا حالا هزاران سیاره خارج از منظومه شمسی کشف کردن، بعضی‌هاشون در \"کمربند حیات\" قرار دارن — جایی که آب مایع ممکنه وجود داشته باشه.\r\n۳. مطالعه قمرها و سیارات نزدیک\r\nمکان‌هایی مثل:\r\nمریخ: احتمال وجود حیات میکروبی در گذشته.\r\nاروپا (قمر مشتری) و انسلادوس (قمر زحل): اقیانوس‌های زیر سطحی که می‌تونن محیط مناسبی برای حیات باشن.\r\n\r\nتا امروز، هیچ مدرک قطعی‌ای برای وجود حیات فرازمینی نداریم، اما شواهد غیرمستقیم، گستردگی عالم، و پیشرفت علم نشون می‌ده که تنها بودن ما در کیهان، بعید به نظر می‌رسه.\r\nشاید هنوز اون‌ها رو پیدا نکرده باشیم — یا شاید اون‌ها سال‌هاست که ما رو زیر نظر دارن!', 1, 0),
(39, 'آینده سفرهای فضایی و رؤیای زندگی در مریخ', 'uploads/1748802496-Journey-to-Mars.jpg', '', '0000-00-00 00:00:00', 'برای قرن‌ها، انسان فقط می‌تونست به آسمون خیره بشه و رویاپردازی کنه؛ اما حالا در دوره‌ای هستیم که این رؤیاها داره رنگ واقعیت می‌گیره. انسان به ماه پا گذاشته، ایستگاه فضایی بین‌المللی ساخته و حالا چشم‌هاش رو به سیاره سرخ دوخته: مریخ.\r\n\r\nآیا واقعاً می‌تونیم روزی روی مریخ زندگی کنیم؟ آینده سفرهای فضایی به چه سمتی می‌ره؟ بیاین با هم بررسی کنیم.\r\n\r\nاز آپولو تا مریخ\r\nاولین گام مهم در سفرهای فضایی، مأموریت‌های آپولو در دهه ۶۰ و ۷۰ میلادی بودن که انسان رو به ماه رسوندن. از اون زمان، علم فضانوردی رشد چشمگیری داشته. حالا برنامه‌هایی مثل آرتِمیس (Artemis) از ناسا، هدفشون بازگشت به ماه و سپس رفتن به مریخ هست.\r\n\r\nچرا مریخ؟\r\nمریخ شبیه‌ترین سیاره به زمینه:\r\nروزهای اون فقط کمی بلندتر از روزهای زمینه.\r\nدارای قطب‌های یخی و تغییرات فصلیه.\r\nشواهدی از آب در گذشته داره.\r\nهمین ویژگی‌ها باعث شده که دانشمندان، مریخ رو بهترین گزینه برای سکونت یا ساخت پایگاه بدون زمین بدونن.\r\n چه زمانی به مریخ می‌ریم؟\r\nپیش‌بینی می‌شه که اولین انسان‌ها در دهه ۲۰۳۰ به مریخ سفر کنن. مأموریت‌های اولیه احتمالاً فقط رفت‌وبرگشت خواهند بود، اما در بلندمدت، هدف ساخت سکونت‌گاه دائمیه.\r\n\r\n جمع‌بندی\r\nزندگی در مریخ شاید هنوز شبیه داستان‌های علمی‌تخیلی باشه، اما سرعت پیشرفت علم نشون می‌ده که فاصله زیادی با این رؤیا نداریم. آینده سفرهای فضایی روشنه، و شاید نسل بعدی انسان‌ها، به‌جای سفر به کشورهای دیگه، دنبال سفر به سیاره‌های دیگه باشن!', 1, 2),
(40, 'عطارد ', 'uploads/1748944656-atarod.png', '', '0000-00-00 00:00:00', 'عطارد نزدیک‌ترین سیاره به خورشید و کوچک‌ترین سیاره منظومه شمسی است. به دلیل نزدیکی بسیار زیاد به خورشید، دمای سطح آن در طول روز بسیار بالا و در شب بسیار پایین می‌شود. سطح آن خشک، سنگی و پر از دهانه‌های برخوردی است که یادآور سطح ماه است. عطارد جو قابل توجهی ندارد و همین باعث نوسان شدید دما بین شب و روز می‌شود. این سیاره هیچ قمری ندارد و چرخش آن به دور خودش بسیار کندتر از چرخش آن به دور خورشید است.', 0, 2),
(41, 'زهره ', 'uploads/1748944672-venus.png', '', '0000-00-00 00:00:00', 'زهره دومین سیاره نزدیک به خورشید و از نظر اندازه و ساختار داخلی بسیار شبیه به زمین است، اما شرایط سطحی آن بسیار خشن و متفاوت است. جو آن بسیار ضخیم، سمی و عمدتاً از دی‌اکسید کربن تشکیل شده و فشار سطحی آن تقریباً ۹۲ برابر زمین است. دمای سطحی آن به حدود ۴۶۵ درجه سانتی‌گراد می‌رسد و به‌دلیل وجود ابرهایی از اسید سولفوریک، سطح زهره از بیرون دیده نمی‌شود. زهره در جهت مخالف سایر سیارات به دور خود می‌چرخد و هیچ قمری ندارد.', 0, 0),
(42, 'زمین ', 'uploads/1748944686-earth.png', '', '0000-00-00 00:00:00', 'زمین تنها سیاره شناخته‌شده‌ای است که در آن حیات وجود دارد. زمین دارای جو متعادلی از نیتروژن و اکسیژن است که شرایط مناسبی برای زندگی فراهم می‌کند. سطح آن شامل قاره‌ها، اقیانوس‌ها، جنگل‌ها، بیابان‌ها و یخچال‌هاست. زمین همچنین دارای یک قمر است که نقش مهمی در پایداری محور چرخش، جزر و مد و سایر پدیده‌های طبیعی دارد. میدان مغناطیسی زمین نیز از برخورد ذرات پرانرژی خورشید با سطح آن جلوگیری می‌کند.', 0, 0),
(43, 'مریخ ', 'uploads/1748944703-merikh.png', '', '0000-00-00 00:00:00', 'مریخ چهارمین سیاره از خورشید و معروف به \"سیاره سرخ\" است. رنگ آن به‌دلیل وجود اکسید آهن یا زنگ‌زدگی روی سطح آن است. مریخ جوی نازک و عمدتاً از دی‌اکسید کربن دارد و دمای سطح آن بسیار سرد است. سطح مریخ دارای کوه‌ها، دره‌های بزرگ مانند دره \"مارینر\"، و نشانه‌هایی از جریان‌های آبی در گذشته است. مریخ دو قمر کوچک به نام‌های فوبوس و دیموس دارد. این سیاره یکی از گزینه‌های اصلی برای سکونت احتمالی انسان در آینده به شمار می‌رود و مأموریت‌های متعددی از سوی ناسا و سایر سازمان‌ها برای بررسی آن انجام شده‌اند.', 0, 2),
(44, 'مشتری ', 'uploads/1748944720-moshtari.png', '', '0000-00-00 00:00:00', 'مشتری بزرگ‌ترین سیاره منظومه شمسی و اولین سیاره غول گازی است. عمدتاً از هیدروژن و هلیوم تشکیل شده و سطح ثابتی ندارد. یکی از ویژگی‌های شاخص آن لکه‌ی قرمز بزرگ است که یک طوفان عظیم و ماندگار در جو آن محسوب می‌شود. مشتری دارای میدان مغناطیسی بسیار قوی و بیش از ۹۰ قمر است که از جمله آن‌ها می‌توان به گانیمد (بزرگ‌ترین قمر منظومه شمسی)، آیو، اروپا و کالستو اشاره کرد. برخی از این قمرها مانند اروپا ممکن است دارای اقیانوس‌های زیرسطحی باشند که امکان حیات را مطرح می‌کند.', 0, 2),
(45, 'زحل ', 'uploads/1748944737-zohal1.png', '', '0000-00-00 00:00:00', 'زحل دومین غول گازی بزرگ منظومه شمسی و ششمین سیاره از خورشید است. زحل بیشتر به‌خاطر حلقه‌های عظیم و زیبای خود شناخته می‌شود که از تکه‌های یخ، سنگ و غبار تشکیل شده‌اند. این سیاره نیز عمدتاً از هیدروژن و هلیوم تشکیل شده و چگالی آن آنقدر کم است که اگر در آب قرار گیرد، روی آب شناور می‌ماند. زحل بیش از ۸۰ قمر دارد که مهم‌ترین آن‌ها تیتان است؛ تیتان قمری با جو ضخیم و دریاچه‌هایی از متان مایع است.', 0, 2),
(46, 'اورانوس ', 'uploads/1748944753-uranos.png', '', '0000-00-00 00:00:00', 'اورانوس اولین سیاره‌ای است که با استفاده از تلسکوپ کشف شد. این سیاره یک غول یخی به شمار می‌رود و جو آن ترکیبی از هیدروژن، هلیوم و مقدار قابل توجهی متان است که رنگ آبی‌ـ‌سبز خاصی به آن می‌دهد. ویژگی منحصر به فرد اورانوس، محور چرخش آن است که تقریباً به‌صورت افقی قرار دارد، گویی که این سیاره روی پهلو می‌چرخد. اورانوس حلقه‌هایی کم‌رنگ و تعدادی قمر نیز دارد.', 0, 2),
(47, 'نپتون ', 'uploads/1748944779-neptun.png', '', '0000-00-00 00:00:00', 'نپتون دورترین سیاره منظومه شمسی است و مانند اورانوس یک غول یخی به شمار می‌رود. جو آن شامل هیدروژن، هلیوم و متان است که رنگ آبی پررنگی به آن داده است. نپتون دارای بادهایی با سرعت بسیار بالا است که حتی از سرعت صوت هم فراتر می‌روند. این سیاره نیز چندین قمر دارد که معروف‌ترین آن تریتون است؛ قمری با ویژگی‌های یخی و احتمال فعالیت‌های زمین‌شناسی.', 0, 2);

--
-- Indexes for dumped tables
--

--
-- Indexes for table `categories`
--
ALTER TABLE `categories`
  ADD PRIMARY KEY (`id`);

--
-- Indexes for table `posts`
--
ALTER TABLE `posts`
  ADD PRIMARY KEY (`id`);

--
-- AUTO_INCREMENT for dumped tables
--

--
-- AUTO_INCREMENT for table `categories`
--
ALTER TABLE `categories`
  MODIFY `id` int(11) NOT NULL AUTO_INCREMENT, AUTO_INCREMENT=7;

--
-- AUTO_INCREMENT for table `posts`
--
ALTER TABLE `posts`
  MODIFY `id` int(11) NOT NULL AUTO_INCREMENT, AUTO_INCREMENT=82;
COMMIT;

/*!40101 SET CHARACTER_SET_CLIENT=@OLD_CHARACTER_SET_CLIENT */;
/*!40101 SET CHARACTER_SET_RESULTS=@OLD_CHARACTER_SET_RESULTS */;
/*!40101 SET COLLATION_CONNECTION=@OLD_COLLATION_CONNECTION */;
